Revit 2027 API
BuiltInFailures.DimensionFailures.CannotConstrainBasePointDimensions Property
 Dimensions to base points cannot be constrained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotConstrainBasePointDimensions { get; }
Public Shared ReadOnly Property CannotConstrainBasePointDimensions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotConstrainBasePointDimensions {
	FailureDefinitionId^ get ();
}
static member CannotConstrainBasePointDimensions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace